//+-----------------------------------------+
//| Автор: Relrin (c) 2011                  |
//|	Библиотека для работы с динамической    |
//| структурой "Очередь (FIFO)"             | 
//|                                         |
//| ПРИМЕЧАНИЕ: При необходимости заменить  |
//| char на нужный тип данных               |
//+-----------------------------------------+
#include <stdio.h>
#include <stdlib.h>
#define  MAXSIZE 100

struct Queue 
{ 
   int data[MAXSIZE]; 
   int size, head, tail;   
}; 

//+--------------------------------------+
//| Добавление элемента в конец очереди  |
//| Queue &Q - адрес на структуру        |
//| int x    - заносимый элемент         |
//+--------------------------------------+
void PushTail ( Queue &Q, int x ) 
{ 
   if ( Q.size == MAXSIZE ) 
   { 
      printf ("Очередь переполнена\n"); 
   return;  
      } 
   Q.tail++; 
   if ( Q.tail >= MAXSIZE ) // замыкание в кольцо 
      Q.tail = 0; 
   Q.data[Q.tail] = x; 
   Q.size ++; 
} 

//+--------------------------------------+
//| Изъятие элемента из очереди          |
//| Queue &Q - адрес на структуру        |
//+--------------------------------------+
int Pop ( Queue &Q ) 
{ 
   int temp; 
   if ( Q.size == 0 )
   { 
      printf ("Очередь пуста\n"); 
      return 32767;       // сигнал об ошибке 
   } 
   temp = Q.data[Q.head]; 
   Q.head ++; 
   if ( Q.head >= MAXSIZE ) Q.head = 0; 
   Q.size --; 
   return temp;    
}

